[
    {
        "title": "Personal Information",
        "content": [
            "DAVID GLASS",
            "Chicago, IL 60618 ⋄ 847.764.9200 ⋄ dglass2525@gmail.com ⋄ thedavidglass.com ⋄ github.com/dglass710 ⋄ linkedin.com/in/david-a-glass"
        ],
        "window_title": "Master",
        "window_width": "1000",
        "window_length": "500",
        "editor_window_width": "900",
        "editor_window_length": "500",
        "main_window_font_size": "20",
        "editor_text_size": "16"
    },
    {
        "title": "Objective",
        "content": [
            "To secure a position as an IT Systems Administrator, maintaining and optimizing enterprise systems and infrastructure while ensuring reliable and secure network operations across on-premises and cloud environments.",
            "To contribute as an IT Systems Administrator by implementing automation scripts, managing cloud resources, and ensuring seamless integration of new technologies to drive operational efficiency.",
            "To leverage my expertise in system configuration, user management, and security hardening to support corporate IT environments, ensuring end-users have secure and reliable access to necessary resources.",
            "To leverage my expertise in cryptography, penetration testing, and secure system design to build robust security frameworks that protect organizational assets. I aim to contribute to proactive threat mitigation and ensure the integrity of critical infrastructure.",
            "To utilize my knowledge of encryption protocols, secure software development, and penetration testing to design, implement, and maintain applications and systems with a focus on minimizing vulnerabilities and maximizing resilience.",
            "To apply my skills in penetration testing, vulnerability assessment, and cryptographic methods to anticipate and mitigate threats, ensuring enterprise systems are prepared for emerging cybersecurity challenges.",
            "To join a dynamic Security Operations Center (SOC) as an analyst, where I can leverage my skills in real-time threat monitoring, vulnerability scanning, and incident response to detect and mitigate potential security risks, ensuring the organization's infrastructure remains secure.",
            "To utilize my expertise in penetration testing, ethical hacking, and security assessments to identify and remediate vulnerabilities, ensuring comprehensive protection for enterprise systems against cyber threats.",
            "To apply my technical skills and hands-on experience with cybersecurity tools and methodologies in a challenging analyst role, contributing to organizational security through proactive risk mitigation and incident handling."
        ]
    },
    {
        "title": "Certifications",
        "content": [
	    "CompTIA Security+ (SY0-701) – Certified",
            "CompTIA PenTest+ (PTO-003) – In Progress"
        ]
    },
    {
        "title": "Education",
        "content": [
            [
                "Northwestern University Cybersecurity Program: Graduated June 2024"
            ],
            [
                "DePaul University: Graduated March 2022",
                "B.S. in Applied and Computational Mathematics; Minors in Computer Science and Physics."
            ]
        ]
    },
    {
        "title": "Core Competencies",
        "content": [
            "Linux Administration",
            "macOS Administration",
            "Windows Administration",
            "Active Directory",
            "Group Policy",
            "Cryptography",
            "Penetration Testing",
            "Vulnerability Assessment",
            "Incident Response",
            "Risk Assessment",
            "Threat Mitigation",
            "Network Security",
            "Firewall Configuration",
            "Firewall Policy Development",
            "Secure Software Development",
            "Docker Security",
            "SSL/TLS Certificate Management",
            "Encryption Protocols (AES, RSA, GPG)",
            "Privilege Escalation",
            "Exploit Development",
            "Packet Analysis",
            "SIEM Analysis",
            "Splunk",
            "Security Onion",
            "Log Analysis",
            "Automation Scripting",
            "Python",
            "Bash",
            "Cron Jobs",
            "Technical Communication",
            "Secure Communication Protocols",
            "Log Correlation and Alerts",
            "OSINT Techniques",
            "Recon-ng",
            "Shodan",
            "Advanced Nmap Scans",
            "Password Cracking (Hashcat)",
            "Cloud Infrastructure Security (Azure, AWS, OCI, Linode)",
            "Data Integrity Validation",
            "Ethical Hacking",
            "Incident Reporting",
            "Digital Evidence Preservation",
            "Load Balancer Configuration",
            "System Hardening",
            "User and Permissions Management",
            "Backup and Archive Management",
            "Process Management",
            "SQL Query Design",
            "Vulnerability Remediation",
            "Application Security",
            "Secure System Design",
            "Google Dorking"
        ]
    },
    {
        "title": "Professional Experience",
        "content": [
            {
                "subtitle": "Mathnasium – Mathematics Instructor",
                "date": "April 2023 – Present, Chicago, IL",
                "details": [
                    "Instructed 370 students in mathematical concepts.",
                    "Enhanced security of iPads used in instruction by implementing guided access controls."
                ]
            },
            {
                "subtitle": "DePaul University Math Department – Undergraduate Student Researcher",
                "date": "November 2020 – May 2022, Chicago, IL",
                "details": [
                    "Developed Python tools for research, focusing on preventing rounding errors in fraction representations.",
                    "Advanced the understanding of the Frobenius coin problem and computed symmetry in large data sets."
                ]
            }
        ]
    },
    {
        "title": "Technical Projects",
        "content": [
            "Developed and implemented firewall policies using UFW and firewalld to ensure secure server configurations and restrict unauthorized access.",
            "Automated user account creation and permissions assignment with Bash scripts, improving efficiency for onboarding processes.",
            "Built and managed a virtual private cloud (VPC) on Azure, deploying virtual machines and configuring secure remote access via SSH.",
            "Deployed and maintained Docker containers for streamlined application development and environment consistency.",
            "Configured cron jobs to automate system maintenance, including backups, log rotation, and system updates.",
            "Developed a secure file-sharing application using encryption protocols like AES and RSA to ensure confidentiality and integrity during data transfer.",
            "Performed application penetration tests to identify vulnerabilities, providing detailed reports and remediation strategies to developers for secure software improvements.",
            "Implemented SSL/TLS encryption for a web application and managed secure certificate handling, ensuring encrypted communication between users and servers.",
            "Designed and executed custom Python scripts to automate vulnerability scanning and mitigate risks across an organization’s network infrastructure.",
            "Created secure Docker container deployments, configuring firewalls and access controls to minimize attack surfaces in production environments.",
            "Conducted penetration tests and network traffic analysis using Metasploit, Nmap, and Wireshark to identify and exploit vulnerabilities in simulated environments.",
            "Configured and monitored a Splunk SIEM environment to analyze security logs, correlate events, and respond to potential threats.",
            "Designed and executed vulnerability scans on virtualized networks, identifying and prioritizing remediation for high-risk exposures.",
            "Created an offline version of the 'Have I Been Pwned' database using Docker, enabling secure local queries of compromised credentials.",
            "Developed and implemented firewall policies using UFW and firewalld to ensure secure network configurations."
        ]
    }
]
